limbs = [
    (0, 15),  # 鼻 - 右目
    (0, 16),  # 鼻 - 左目
    (0, 1),  # 鼻 - 首
    (1, 2),  # 首 - 右肩
    (1, 5),  # 首 - 左肩
    (1, 8),  # 首 - 腰
    (2, 3),  # 右肩 - 右肘
    (3, 4),  # 右肘 - 右手首
    (5, 6),  # 左肩 - 左肘
    (6, 7),  # 左肘 - 左手首
    (8, 9),  # 腰 - 右腰
    (8, 12),  # 腰 - 左腰
    (9, 10),  # 右腰 - 右膝
    (10, 11),  # 右膝-右足首
    (11, 22),  # 右足首 - 右足親指
    (11, 24),  # 右足首 - 右足かかと
    (12, 13),  # 左腰 - 左膝
    (13, 14),  # 左膝-左足首
    (14, 19),  # 左足首 - 左足親指
    (14, 21),  # 左足首 - 左足かかと
    (15, 17),  # 右目-右耳
    (16, 18),  # 左目-左耳
    (19, 20),  # 左足親指 - 左足小指
    (22, 23),  # 右足親指 - 右足小指
]

#kinect
#足親指はいらない
